`
    #1: Установка и настройка Babel
        'BABEL' - пердназначен для тринспиляции исходного кода ES6 в ES5.


    Новое в ES6:
        - let       объявление переменной с областью видимости, ограниченной блоком кода {}.
        - const     объявление переменной, значения которые нельзя изменить в ходе программы.
                        должна быть объявленна только один раз и значение присвоино сразу
                особенноси let и const с Hoistg
                    переменные объявленные с пом. let не поднимаються (т.е. нельзя использовать переменную до её объявления)

        - Оператор разворота (spread operator)
                    разворачивает элементы массива для передачи в качестве аргументов функции или в элементы другого массива.

        - Шаблонные строки (template strings)
                    поддерживают многострочность, интерполяцию выражений и тегирование.

        - Параметры функции 
                    парамеры по умолчанию (default parametrs)
                    оставшиеся параметры (rest parametrs)

        - Array.reduse

        - Цикл for...of 
                    итерация массивов

        - Object
            нововведения в синтаксисе при работе с литералами объектов:
                * если имя св. объекта совпадает с именем переменной, можно указывать только имя св.
                * синтакcис методов объекта: sayHello(){ ...};
                * добавлена возможность исп. синтаксис obj[] внутри объекта, тем самым, динамически указывать имя свойства

 
  
` 